In [3]:
import pandas as pd

In [4]:
df=pd.read_csv("https://raw.github.com/datasciencedojo/datasets/master/titanic.csv")

In [5]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [6]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [7]:
s=df['Name']

In [8]:
s

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [9]:
type(s)

pandas.core.series.Series

In [10]:
len(s)

891

In [11]:
s=df['Name'][0:9]

In [12]:
s#in series index is shown ,if we want to pass our named index not this default index.

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
5                                     Moran, Mr. James
6                              McCarthy, Mr. Timothy J
7                       Palsson, Master. Gosta Leonard
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
Name: Name, dtype: object

In [13]:
l=['a','b','c','d','e','f','g','h','i']#named index creted in list.

In [14]:
pd.Series(s,index=l) #s data nullify here,for data we have to pass in list

a    NaN
b    NaN
c    NaN
d    NaN
e    NaN
f    NaN
g    NaN
h    NaN
i    NaN
Name: Name, dtype: object

In [15]:
s1=pd.Series(list(s),index=l) #we sucessfully creted named index.,but also recognized default indexing.

In [16]:
s#default index

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
5                                     Moran, Mr. James
6                              McCarthy, Mr. Timothy J
7                       Palsson, Master. Gosta Leonard
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
Name: Name, dtype: object

In [17]:
s1#named index

a                              Braund, Mr. Owen Harris
b    Cumings, Mrs. John Bradley (Florence Briggs Th...
c                               Heikkinen, Miss. Laina
d         Futrelle, Mrs. Jacques Heath (Lily May Peel)
e                             Allen, Mr. William Henry
f                                     Moran, Mr. James
g                              McCarthy, Mr. Timothy J
h                       Palsson, Master. Gosta Leonard
i    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
dtype: object

In [19]:
s[0]

'Braund, Mr. Owen Harris'

In [20]:
s1[0]

'Braund, Mr. Owen Harris'

In [22]:
s1['a']#therofore it recognized both named as well as default index

'Braund, Mr. Owen Harris'

In [24]:
s2=s1.append(s)#we can also perform append operation as list

/tmp/ipykernel_77/581144302.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s2=s1.append(s)#we can also perform append operation as list

In [25]:
s2

a                              Braund, Mr. Owen Harris
b    Cumings, Mrs. John Bradley (Florence Briggs Th...
c                               Heikkinen, Miss. Laina
d         Futrelle, Mrs. Jacques Heath (Lily May Peel)
e                             Allen, Mr. William Henry
f                                     Moran, Mr. James
g                              McCarthy, Mr. Timothy J
h                       Palsson, Master. Gosta Leonard
i    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
5                                     Moran, Mr. James
6                              McCarthy, Mr. Timothy J
7                       Palsson, Master. Gosta Leonard
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
dtype: object

In [27]:
s2[0] #which data gaves s2 default index or named index we does not prove here because both indexs data are same that why prove below.

'Braund, Mr. Owen Harris'

In [31]:
s4=pd.Series([3,4,5,6,4], index=[2,3,4,5,1])

In [37]:
s5=pd.Series([22,64,32,83,49],index=[9,8,7,4,5])

In [38]:
s6=s4.append(s5)

/tmp/ipykernel_77/884104408.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s6=s4.append(s5)

In [39]:
s6

2     3
3     4
4     5
5     6
1     4
9    22
8    64
7    32
4    83
5    49
dtype: int64

In [40]:
s6[4]#it takes named index

4     5
4    83
dtype: int64

In [41]:
s6[0:5] #it takes default index but it deolicate in future.for slicing case it takes default index for othercase it takes named index.

/tmp/ipykernel_77/2671872114.py:1: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  s6[0:5]

2    3
3    4
4    5
5    6
1    4
dtype: int64

In [43]:
s4

2    3
3    4
4    5
5    6
1    4
dtype: int64

In [44]:
s5

9    22
8    64
7    32
4    83
5    49
dtype: int64

In [45]:
s4*s5#multiply means in s4 and s5 both named index there is '4' named index, if both index is same then it give value ,otherwise it gave Nan.

1      NaN
2      NaN
3      NaN
4    415.0
5    294.0
7      NaN
8      NaN
9      NaN
dtype: float64

In [46]:
s4+s5 #same as above

1     NaN
2     NaN
3     NaN
4    88.0
5    55.0
7     NaN
8     NaN
9     NaN
dtype: float64

In [ ]:
#series more like list ,dataframe a comibation of a series